In [7]:
import os
os.getcwd()
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [10]:
# Instanciación de un DataFrame con columnas y datos e index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]
df_index = ["A", "B", "C","D","E"]

In [11]:
df = pd.DataFrame(data=df_data, columns=df_columns, index=df_index )
df
# Si no se asgina un Index particular, pandas asigna uno por default comenzando desde 0

   id     name  lastname          city        tel_pre                    email
A   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
B   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
C   3    Cobra  Cobretti       Angeles             +1  international@right.com
D   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
E   5  Lincoln      Hawk      Colorado           +719              am@am64.com

TypeError: no numeric data to plot

In [12]:
df.loc["B", "city"]

'Philadelphia'

In [41]:
df.iloc[1, 2]

'Balboa'

In [42]:
# Instanciación de un DataFrame con columnas y datos SIN index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]

In [43]:
df = pd.DataFrame(data=df_data, columns=df_columns)
df
# Si no se asgina un Index particular, pandas asigna uno por default comenzando desde 0

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [9]:
type(df)

pandas.core.frame.DataFrame

In [44]:
type(df["name"]) #row siempre un index = 0 en el axis     y la columna el axis=1

pandas.core.series.Series

In [45]:
# Forma NO recomendada de seleccionar una columna.
# Se puede confundir con los métodos o funciones de pandas
df.name

(5, 6)

## Selección de Columnas del DataFrame

In [12]:
# Forma SI recomendada de seleccionar una columna
df["name"]

0       John
1      Rocky
2      Cobra
3     Joseph
4    Lincoln
Name: name, dtype: object

In [13]:
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email'], dtype='object')

In [22]:
# Para seleccionar varias columnas se pasa una lista al DataFrame
df[["id","city","email"]]

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [23]:
df

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [25]:
df = df[["id","city","email"]].copy()
df

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [17]:
type(df[["id","city","email"]])    #df1 = df

pandas.core.frame.DataFrame

In [20]:
df1 = df[["id","city","email"]].copy()
df1

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [28]:
df

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

## Asignación de una nueva columna al DataFrame

In [30]:
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email'], dtype='object')

In [56]:
df["full_name"] = df["name"] + " " + df["lastname"]
df

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,Rocky Balboa
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

## Eliminar columna en el DF

In [57]:
df_2 = df.drop("full_name", axis=1)   # axis=0  es para los rows, indices
# parámetro axis=1 para indicar que se trata de una columna, 
# sino arrojará error no sabiendo si es index o columna. Además no hay index "new_column"
# el "axis" se hereda del array NumPy
#
# parámetro inplace=True, para que guarde el cambie en el DataFrame. 
# Por default está en False. Pandas lo hace para que no se pierda información de forma accidental
#df

In [59]:
df_2

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

## Eliminar fila en el DF

In [60]:
# No hace falta especificar el axis=0, solo la fila según el index. 
# Y el inplace=True si se quiere guardar el cambio en el df
df.drop(1)  # por default siempre el axis=0
# regex notation

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

In [61]:
df

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,Rocky Balboa
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

## Consultar dimensiones del DF

In [42]:
# sin ()
# tupla con las dimensiones
df.shape

(5, 7)

## Consultar columnas del DF

In [45]:
# sin ()
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email', 'full_name'], dtype='object')

## Consultar tipo de datos en columnas del DF

In [47]:
df["float_num"] = 3.5

In [48]:
df.dtypes

id             int64
name          object
lastname      object
city          object
tel_pre       object
email         object
full_name     object
float_num    float64
dtype: object

## Métodos .loc & .iloc

In [81]:
# Instanciación de un DataFrame con columnas y datos e index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]
df = pd.DataFrame(data=df_data, columns=df_columns)
df

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

# Reset index

In [82]:
df.drop(2, inplace=True)
df

   id     name lastname          city        tel_pre                   email
0   1     John    Rambo        Jungle            +84  greenbone@vietcong.com
1   2    Rocky   Balboa  Philadelphia             +1    urssdown@adriana.com
3   4   Joseph    Dredd        Tierra  +516684116547      niunchance@apo.com
4   5  Lincoln     Hawk      Colorado           +719             am@am64.com

In [87]:
df.reset_index(drop=True, inplace=True)

In [88]:
df

   id     name lastname          city        tel_pre                   email
0   1     John    Rambo        Jungle            +84  greenbone@vietcong.com
1   2    Rocky   Balboa  Philadelphia             +1    urssdown@adriana.com
2   4   Joseph    Dredd        Tierra  +516684116547      niunchance@apo.com
3   5  Lincoln     Hawk      Colorado           +719             am@am64.com

In [89]:
for i in range(len(df)):
    print(df.loc[i,"city"])

Jungle
Philadelphia
Tierra
Colorado

In [85]:
df.reset_index(drop=True, inplace=True)

   id     name lastname          city        tel_pre                   email
0   1     John    Rambo        Jungle            +84  greenbone@vietcong.com
1   2    Rocky   Balboa  Philadelphia             +1    urssdown@adriana.com
2   4   Joseph    Dredd        Tierra  +516684116547      niunchance@apo.com
3   5  Lincoln     Hawk      Colorado           +719             am@am64.com

# Concat, Merge, Append, Join

In [2]:
import pandas as pd

## Concat

In [90]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [91]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'E': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    E
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [94]:
pd.concat([df1,df2,df3])

      A    B    C    D    E
0    A0   B0   C0   D0  NaN
1    A1   B1   C1   D1  NaN
2    A2   B2   C2   D2  NaN
3    A3   B3   C3   D3  NaN
4    A4   B4   C4   D4  NaN
5    A5   B5   C5   D5  NaN
6    A6   B6   C6   D6  NaN
7    A7   B7   C7   D7  NaN
8    A8   B8   C8  NaN   D8
9    A9   B9   C9  NaN   D9
10  A10  B10  C10  NaN  D10
11  A11  B11  C11  NaN  D11

In [7]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merg

In [95]:
df_left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df_left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [96]:
df_right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})   
df_right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [10]:
# Parecido a los comandos PLSQL
pd.merge(df_left, df_right, how="inner", on="key")   
# how --> inner, right, left, outer
# on --> lista de claves, si son múltilples --> on=["key1", "key2"]

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Append

In [97]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [98]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']})
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [36]:
df1 = df1.append(df2)
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [38]:
#drop=True
df1.reset_index()

   index   A   B   C   D
0      0  A0  B0  C0  D0
1      1  A1  B1  C1  D1
2      2  A2  B2  C2  D2
3      3  A3  B3  C3  D3
4      0  A4  B4  C4  D4
5      1  A5  B5  C5  D5
6      2  A6  B6  C6  D6
7      3  A7  B7  C7  D7

## Join

In [99]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [100]:
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'A': ['C0', 'C1', 'C2', 'C3'],
                          'B': ['D0', 'D1', 'D2', 'D3']})   
df2

  key   A   B
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [101]:
df1.join(df2, how="left", lsuffix="_pepito", rsuffix="_rosita" )

  key_pepito A_pepito B_pepito key_rosita A_rosita B_rosita
0         K0       A0       B0         K0       C0       D0
1         K1       A1       B1         K1       C1       D1
2         K2       A2       B2         K2       C2       D2
3         K3       A3       B3         K3       C3       D3

# El poderoso método Apply()

In [16]:
import numpy as np
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,5),["A","B","C","D","E"],["col_1","col_2","col_3","col_4","col_5"])
df

      col_1     col_2     col_3     col_4     col_5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [17]:
# imaginen una función
def dos_veces_2(x):
    return x*2

In [18]:
df["col_1"].apply(dos_veces_2)

A    5.413700
B   -0.638636
C    1.057627
D    1.910113
E    0.605331
Name: col_1, dtype: float64

In [24]:
# Pandas permite aplicarla al DataFrame a través de este método
df["col_1"] = df["col_1"].apply(dos_veces_2)
df["col_1"]

A    10.827399
B    -1.277272
C     2.115254
D     3.820226
E     1.210662
Name: col_1, dtype: float64

In [31]:
def df_col_sustr(x, y):
    return (x - y)

In [32]:
df["col_resta"] = None

In [35]:
df["col_resta"] = df["col_resta"].apply(df_col_sustr(df["col_1"], df["col_2"]))

TypeError: 'Series' object is not callable

## Es más poderoso aún cuando lo usamos con expresiones lambda

In [ ]:
def dos_veces_2(x):
    return x*2

In [20]:
df["col_2"].apply(lambda x: x-1)

A   -0.371867
B   -1.848077
C   -1.589001
D   -0.809206
E    0.693723
Name: col_2, dtype: float64

In [22]:
df["col_2"]

A    0.628133
B   -0.848077
C   -0.589001
D    0.190794
E    1.693723
Name: col_2, dtype: float64

# Input & Output Data

### Input

In [3]:
import os
os.getcwd()

'/home/isaias/Codes/notebooks/educacion_it/mierc_20210127'

In [4]:
import pandas as pd

In [102]:
df = pd.read_csv("pres_ed_it.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
# Diferentes tipos de lectura (json, clipboard, html, xlsx, sql)
pd.read_

### Output

In [103]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [106]:
df["new_column"] = "Nueva columna"

In [110]:
df.index = ["A", "B", "C", "D"]

In [111]:
df

    a   b   c   d  nueva_columna     new_column
A   0   1   2   3  Nueva columna  Nueva columna
B   4   5   6   7  Nueva columna  Nueva columna
C   8   9  10  11  Nueva columna  Nueva columna
D  12  13  14  15  Nueva columna  Nueva columna

In [113]:
# si vuelvo a leer el output con read_csv voy a tener un nuevo index
df.to_csv("pres_ed_it_output_nuevo.csv", index=False)

# JSON

In [114]:
df_from_json_pepito = pd.read_json("customrobots.json")

In [115]:
df_from_json_pepito

,processid,processname,robotid,robotname,businessunitarea,robotcreationdatetime,robotcreatedby,robotmodificationdatetime,robotmodifiedby
0,100,Bill A,1,ARD2,Billing,2020-08-14 17:10:12.167,user@company,2020-08-14 17:10:12.167,user@company
1,101,Bill B,1,ARD2,Billing,2020-08-14 17:10:12.167,user@company,2020-08-14 17:10:12.167,user@company
2,102,Bill C,1,ARD2,Billing,2020-08-14 17:10:12.167,user@company,2020-08-14 17:10:12.167,user@company
3,120,Policy A47,2,C3PO,Policies,2020-08-14 17:10:12.167,user@company,2020-08-14 17:10:12.167,user@company
4,121,Policy B306,2,C3PO,Policies,2020-08-14 17:10:12.167,user@company,2020-08-14 17:10:12.167,user@company

In [ ]:
df.to_sql("table_name", conn)

# SQL

In [116]:
from sqlalchemy import create_engine

In [117]:
# conn de db super liviano que está en memoria
conn = create_engine("sqlite:///:memory:")

In [118]:
df

    a   b   c   d  nueva_columna     new_column
A   0   1   2   3  Nueva columna  Nueva columna
B   4   5   6   7  Nueva columna  Nueva columna
C   8   9  10  11  Nueva columna  Nueva columna
D  12  13  14  15  Nueva columna  Nueva columna

In [119]:
# nombre_de_tabla, conector
df.to_sql("tabla_pepito", conn)

In [122]:
df_pepito  = pd.read_sql("tabla_pepito", conn)

In [123]:
df_pepito

  index   a   b   c   d  nueva_columna     new_column
0     A   0   1   2   3  Nueva columna  Nueva columna
1     B   4   5   6   7  Nueva columna  Nueva columna
2     C   8   9  10  11  Nueva columna  Nueva columna
3     D  12  13  14  15  Nueva columna  Nueva columna

In [ ]:
df.to_pickle